[View in Colaboratory](https://colab.research.google.com/github/tkms0106/python-data-science/blob/master/python_data_science4_36.ipynb)

In [0]:
from pandas import DataFrame

In [0]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                   'altitude':[3158,3000,2752]})

In [3]:
dframe

   altitude        city
0      3158        Alma
1      3000  Brian Head
2      2752    Fox Park

In [0]:
state_map = {'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park':'Wyoming'}

In [0]:
dframe['state'] = dframe['city'].map(state_map)

In [6]:
dframe

   altitude        city     state
0      3158        Alma  Colorado
1      3000  Brian Head      Utah
2      2752    Fox Park   Wyoming

In [0]:
dframe['key1'] = [0,1,2]

In [8]:
dframe

   altitude        city     state  key1
0      3158        Alma  Colorado     0
1      3000  Brian Head      Utah     1
2      2752    Fox Park   Wyoming     2